; domain
; source: https://github.com/AI-Planning/pddl-generators/blob/main/ferry/domain.pddl
; updates: typing car and locations; sail precs have now (not (at-ferry ?to)) so (not-eq ?from ?to) can be removed
(define (domain ferry)
   (:requirements :typing :strips :negative-preconditions)
   (:types car - object 
           location - object)

   (:predicates
		(at-ferry ?l - location)
		(at ?c - car ?l - location)
		(empty-ferry)
		(on ?c - car))

   (:action sail
       :parameters  (?from - location ?to - location)
       :precondition (and (at-ferry ?from) (not (at-ferry ?to)))
       :effect (and  (at-ferry ?to) (not (at-ferry ?from))))

   (:action board
       :parameters (?car - car ?loc - location)
       :precondition (and (at ?car ?loc) (at-ferry ?loc) (empty-ferry))
       :effect (and
            (on ?car)
		    (not (at ?car ?loc)) 
		    (not (empty-ferry))))

   (:action debark
       :parameters (?car - car  ?loc - location)
       :precondition (and (on ?car) (at-ferry ?loc))
       :effect (and
            (at ?car ?loc)
		    (empty-ferry)
		    (not (on ?car)))))

; problem
(define (problem ferry-54)
 (:domain ferry)
 (:objects 
    car1 car2 car3 car4 car5 car6 car7 car8 car9 car10 - car
    loc1 loc2 loc3 loc4 loc5 loc6 loc7 loc8 loc9 loc10 - location
 )
 (:init 
    (empty-ferry)
    (at-ferry loc5)
    (at car1 loc1)
    (at car2 loc8)
    (at car3 loc1)
    (at car4 loc9)
    (at car5 loc6)
    (at car6 loc4)
    (at car7 loc8)
    (at car8 loc8)
    (at car9 loc9)
    (at car10 loc6)
)
 (:goal (and 
(at car1 loc4)
(at car2 loc10)
))
)

; plan
1. (sail loc5 loc1)
   deleted: (at-ferry loc5)
   added: (at-ferry loc1)
   goals met: 0 of 2
2. (board car1 loc1)
   deleted: (at car1 loc1) (empty-ferry)
   added: (on car1)
   goals met: 0 of 2
3. (sail loc1 loc4)
   deleted: (at-ferry loc1)
   added: (at-ferry loc4)
   goals met: 0 of 2
4. (debark car1 loc4)
   deleted: (on car1)
   added: (at car1 loc4) (empty-ferry)
   goals met: 1 of 2
5. (sail loc4 loc8)
   deleted: (at-ferry loc4)
   added: (at-ferry loc8)
   goals met: 1 of 2
6. (board car2 loc8)
   deleted: (at car2 loc8) (empty-ferry)
   added: (on car2)
   goals met: 1 of 2
7. (sail loc8 loc10)
   deleted: (at-ferry loc8)
   added: (at-ferry loc10)
   goals met: 1 of 2
8. (debark car2 loc10)
   deleted: (on car2)
   added: (at car2 loc10) (empty-ferry)
   goals met: 2 of 2
